# Pandas Exercise 1

- Create a Series named Total_Sales with the values as 12000,25000,27500,27150 for the regions east, west, north and south.

- Rank the Sales in ascending order.

In [62]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [63]:
total_sales = Series([12000,25000,27500,27150], index = ["east", "west", "north","south"])

In [64]:
total_sales.sort_values(ascending=True)

east     12000
west     25000
south    27150
north    27500
dtype: int64

# Pandas Exercise 2

- From the Sales_table extract the total amount field and find out the percentage change between the values in numPy.

In [95]:
sales_dict = pd.read_excel("Sales_table.xlsx")
sales_dict

    Sno       Date Salesperson  Total_amount
0     0 2000-01-03       Allen         12000
1     1 2000-01-04       Allen         15000
2     2 2000-01-05       Allen         25000
3     3 2000-01-03      Mathew         35000
4     4 2000-01-04      Mathew         65000
5     5 2000-01-05      Mathew         75000
6     6 2000-01-03      Clarke         65780
7     7 2000-01-04      Clarke         54670
8     8 2000-01-05      Clarke         77900
9     9 2000-01-03         Don         89000
10   10 2000-01-04         Don         70000
11   11 2000-01-05         Don         65000

In [96]:
sales = sales_dict["Total_amount"]
sales

0     12000
1     15000
2     25000
3     35000
4     65000
5     75000
6     65780
7     54670
8     77900
9     89000
10    70000
11    65000
Name: Total_amount, dtype: int64

In [105]:
perc_ser =[]
for x in range(len(sales)-1):
    first = sales[x]
    last = sales[x+1]
    perc = ((last-first)/first)*100
    perc_ser.append(f"{perc:.2f}%")

In [106]:
perc_ser

['25.00%',
 '66.67%',
 '40.00%',
 '85.71%',
 '15.38%',
 '-12.29%',
 '-16.89%',
 '42.49%',
 '14.25%',
 '-21.35%',
 '-7.14%']

# Python Exercise 3

- Reading from .csv files

In [70]:
dframe = pd.read_csv("Jes.csv",sep = ",", header =None) # "sep" ensures the table is stored as a table
# setting the header to None ensures the first row of data is not counted as a header
dframe

    0   1   2   3        4
0   a   b   c   d    apple
1   e   f   g   h   banana
2   i   j   k   l   Cherry
3   m   n   o   p    derry

In [71]:
dframe = pd.read_csv("Jes.csv", header = None, nrows = 2)
dframe

    0   1   2   3       4
0   a   b   c   d   apple
1   e   f   g   h  banana

### Writing to .csv files

In [72]:
dframe.to_csv("sample.csv")

### Displaying data directly onto the screen

In [73]:
import sys

In [74]:
dframe.to_csv(sys.stdout) # rather than saving a file, the csv data is displayed on the screen

,0,1,2,3,4
0, a, b, c, d, apple
1,e,f,g,h,banana

In [75]:
dframe.to_csv(sys.stdout, sep="_") # The separator can be changed to whatever you wish

_0_1_2_3_4
0_ a_ b_ c_ d_ apple
1_e_f_g_h_banana

### Retrieving the column values

In [76]:
dframe.to_csv(sys.stdout,columns=[0,1,2]) # Takes only the columns with the specified indices

,0,1,2
0, a, b, c
1,e,f,g